spec/cassettes/Afterpay_Merchant/direct_payment_flow/should_be_approved.yml

---
http_interactions:
- request:
    method: post
    uri: https://32935:249c235938f36015bb32571721ba2dc80257d2fe985799c30a0e5877408991b596b117d998e0528a7872103f8fc80e07d71163c801b22153149ac6a0919b588a@api-sandbox.secure-afterpay.com.au/v1/orders
    body:
      encoding: UTF-8
      string: '{"totalAmount":{"amount":319,"currency":"AUD"},"consumer":{"givenNames":"Fame","surname":"Partners","email":"dev@fameandpartners.com"},"merchant":{"redirectConfirmUrl":"https://localhost:3000/dresses","redirectCancelUrl":"https://localhost:3000/dresses"}}'
    headers:
      User-Agent:
      - AfterpaySDK/sdk-core-ruby 0.0.1 (afterpay-sdk-core 0.0.1; ruby 2.1.6p336-x86_64-linux)
      X-Afterpay-Request-Source:
      - merchant-ruby-sdk-0.0.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Use-Vcr:
      - true
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Fri, 23 Sep 2016 13:06:51 GMT
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Content-Type:
      - application/json
      Http-Correlation-Id:
      - 8495ddf9-8312-4706-a86a-b4d707b1b67f
      Content-Length:
      - '112'
    body:
      encoding: UTF-8
      string: |-
        {
          "token" : "en80kcgj051hrsuhsu03sa7t1624gn8nug7858k3ic9supucehe7",
          "expires" : "2016-09-23T13:36:51.793Z"
        }
    http_version: 
  recorded_at: Fri, 23 Sep 2016 13:06:51 GMT
- request:
    method: get
    uri: https://32935:249c235938f36015bb32571721ba2dc80257d2fe985799c30a0e5877408991b596b117d998e0528a7872103f8fc80e07d71163c801b22153149ac6a0919b588a@api-sandbox.secure-afterpay.com.au/v1/orders/en80kcgj051hrsuhsu03sa7t1624gn8nug7858k3ic9supucehe7
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - AfterpaySDK/sdk-core-ruby 0.0.1 (afterpay-sdk-core 0.0.1; ruby 2.1.6p336-x86_64-linux)
      X-Afterpay-Request-Source:
      - merchant-ruby-sdk-0.0.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Use-Vcr:
      - true
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 23 Sep 2016 13:05:04 GMT
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - private, no-cache, no-store, no-transform, must-revalidate, max-age=0
      Pragma:
      - no-cache
      Expires:
      - '0'
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Content-Type:
      - application/json
      Http-Correlation-Id:
      - b563f557-b7bb-49f0-ae57-5d6307f9882e
      Vary:
      - Accept-Encoding
      Content-Length:
      - '333'
    body:
      encoding: UTF-8
      string: |-
        {
          "expires" : "2016-09-23T13:35:03.063Z",
          "token" : "en80kcgj051hrsuhsu03sa7t1624gn8nug7858k3ic9supucehe7",
          "totalAmount" : {
            "amount" : "319.00",
            "currency" : "AUD"
          },
          "consumer" : {
            "givenNames" : "Fame",
            "surname" : "Partners",
            "email" : "dev@fameandpartners.com"
          },
          "courier" : { },
          "merchant" : {
            "redirectConfirmUrl" : "https://localhost:3000/dresses",
            "redirectCancelUrl" : "https://localhost:3000/dresses"
          },
          "paymentType" : "PAY_BY_INSTALLMENT",
          "items" : [ ],
          "discounts" : [ ]
        }
    http_version: 
  recorded_at: Fri, 23 Sep 2016 13:05:04 GMT
- request:
    method: post
    uri: https://32935:249c235938f36015bb32571721ba2dc80257d2fe985799c30a0e5877408991b596b117d998e0528a7872103f8fc80e07d71163c801b22153149ac6a0919b588a@api-sandbox.secure-afterpay.com.au/v1/payments/capture
    body:
      encoding: UTF-8
      string: '{"token":"en80kcgj051hrsuhsu03sa7t1624gn8nug7858k3ic9supucehe7"}'
    headers:
      User-Agent:
      - AfterpaySDK/sdk-core-ruby 0.0.1 (afterpay-sdk-core 0.0.1; ruby 2.1.6p336-x86_64-linux)
      X-Afterpay-Request-Source:
      - merchant-ruby-sdk-0.0.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Mon, 26 Sep 2016 14:30:21 GMT
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Content-Type:
      - application/json
      Http-Correlation-Id:
      - b003d29a-335f-4114-ba36-93cea4da3d60
      Content-Length:
      - '879'
    body:
      encoding: UTF-8
      string: |-
        {
          "id" : "23843388",
          "token" : "en80kcgj051hrsuhsu03sa7t1624gn8nug7858k3ic9supucehe7",
          "status" : "APPROVED",
          "created" : "2016-09-23T10:44:25.759Z",
          "totalAmount" : {
            "amount" : "319.00",
            "currency" : "AUD"
          },
          "merchantReference" : "R225157817",
          "refunds" : [ ],
          "orderDetails" : {
            "consumer" : {
              "phoneNumber" : "2255-4422",
              "givenNames" : "Fame",
              "surname" : "Partners",
              "email" : "dev@fameandpartners.com"
            },
            "billing" : {
              "name" : "John Doe",
              "line1" : "Empty Str.",
              "suburb" : "Suburb",
              "state" : "NSW",
              "postcode" : "1234"
            },
            "shipping" : {
              "name" : "John Doe",
              "line1" : "Empty Str.",
              "suburb" : "Suburb",
              "state" : "NSW",
              "postcode" : "1234"
            },
            "courier" : { },
            "items" : [ ],
            "discounts" : [ ]
          },
          "events" : [ ]
        }
    http_version: 
  recorded_at: Mon, 26 Sep 2016 14:11:59 GMT
recorded_with: VCR 2.9.3
